<?php

if (empty($_BATCH_FLAG)) $_BATCH_FLAG = false;

$_SYSTEM_MODE = "develop";
//$_SYSTEM_MODE = "real";

if( $_SYSTEM_MODE == "local" ) {
	$_INC['db']['master'] = array(
		'host'	=>'localhost',
		'user'	=>'aglmain',
		'pass'	=>'@WeareAGL!!@',
		'db'	=>'heytee',
		'port'	=>'413',
	);
}
else if( $_SYSTEM_MODE == 'develop') {
    // mySql
    $_INC['db']['master'] = array(
        'host'	=>'dev-phpbo.c4lf1j5zgbxo.ap-northeast-2.rds.amazonaws.com',
        //'host'	=>'13.124.139.129',
        'user'	=>'aglsc',
        'pass'	=>'aglsctest!@#$',
        'db'	=>'aglsc',
        'port'	=>'3306',
    );

    // msSql
    $_INC['db']['HTT20'] = array(
        'host'	=>'dev-htt20-db.c4lf1j5zgbxo.ap-northeast-2.rds.amazonaws.com',
        'user'	=>'AGL20',
#        'pass'	=>'agldjemals1234!@#$',
        'pass'	=>'gpdlxlxkdla20',
        'db'	=>'HTT20',
        'port'	=>'1433',
    );
} else if( $_SYSTEM_MODE == 'real' ) {
    /*$_INC['db']['master'] = array(
        'host'	=>'13.124.139.129',
        'user'	=>'aglsc',
        'pass'	=>'aglsctest!@#$',
        'db'	=>'aglsc',
        'port'	=>'3306',
    );*/
}

//관리자 접속 가능한 IP
$_INC['admin_ip'] = array(
	"222.109.244.205",	// 2층
	"222.109.244.219",	// 3층
	"121.130.212.235",	// 4층
	"118.32.134.212",	// 4층
	"211.46.59.54",		// 5층
	"220.117.31.88",	// 6층
    "118.37.1.137",	// 6층
    "192.168.0.51",

    "127.0.0.1",        // test
    "222.108.131.250",
);


//모든메뉴에 접근 가능한 아이디
$_INC['super_id'] = array("mwhyun");

//관리자 비번 encrypt 키 
$_INC['env'] = array(
	'encrypt_key' => 'AGL_AES_s9s8yBQ2',
    'nfs_key' => '@aglmedia!240605',
);

$_INC['jwtKey'] = 'agl';

$_INC['date_type'] = [
    'DATE_YMDHIS'   => date('Y-m-d H:i:s'),
    'DATE_YMD'      => date('Y-m-d'),
];

// 서비스관리 > 계정등록의 상태값
$_INC['account_status'] = [
    '0' => [
        'name'  => '삭제',
    ],
    '1' => [
        'name'  => '정상',
    ],
    '2' => [
        'name'  => '일시정지',
    ],
];

// 약관 구분
$_INC['agree_gubun'] = [
    '0' => '이용약관',
    '1' => '개인정보보호정책',
    '2' => '국내여행약관',
    '3' => '국외여행약관',
    '4' => '개인(신용)정보수집',
    '5' => '개인(신용)정보 제3자제공',
];

// 1:1문의 구분
$_INC['inquiry_gubun'] = [
    '0' => '상품 / 여행문의',
    '1' => '맞춤 / 단체 / 행사문의',
    '2' => '예약 / 결제 / 취소 / 환불문의',
    '3' => '가입 / 로그인 / 계정문의',
    '4' => '제휴 / 마케팅 문의',
    '5' => '골프장 입점 / 티타임 판매 문의',
    '6' => '기타 문의',
];

// 1:1문의 상태값 구분
$_INC['inquiry_status'] = [
    '0' => '답변대기',
    '1' => '답변준비중',
    '2' => '답변완료',
];

// 예약 상태값 구분
$_INC['booking_status'] = [
    '0' => '예약불가',
    '1' => '예약요청',
    '2' => '예약확정',
    '3' => '재주문',
];

// 결제수단
$_INC['price_method'] = [
    '0' => '신용카드',
    '1' => '계좌이체',
    '2' => '간편결제',
];

// 결제상태
$_INC['price_status'] = [
    '0' => '결제취소',
    '1' => '결제미요청',
    '2' => '결제요청',
    '3' => '부분결제',
    '4' => '결제완료',
];

// 여행상품구분
$_INC['tour_list'] = [
    '1' => '티타임Only',
    '2' => '티타임 + 숙박',
    '3' => '티타임 + 숙박 + 송영',
    '4' => '티타임 + 송영',
    '5' => '티타임 + 숙박 + 송영 + 항공',
    '9' => '다색',
];

// 채널 상태
$_INC['channel_status'] = [
    '0' => '등록해지',
    '1' => '등록요청',
    '2' => '등록완료',
    '3' => '정지중',
];

// 사이트 상태
$_INC['site_status'] = [
    '0' => '종료',
    '1' => '준비중',
    '2' => '오픈',
    '3' => '정지중',
];

// 푸시 구분값
$_INC['push_gubun'] = [
    '0' => '기획전',
    '1' => '상품',
    '2' => '이벤트',
    '3' => '공지/알림',
    '9' => '기타',
];

// 푸시 수신자 설정
$_INC['push_receive_type'] = [
    '0' => '전체발송',
    '1' => '파일등록',
    '2' => '조건선택',
    '3' => '발솔자선택',
];

// 결제방법
$_INC['pay_type'] = [
    'CARD'  => '신용카드',
    'BANK'  => '계좌이체',
    'VBANK' => '가상계좌',
];

//예약상태
$_INC['reservation_type'] = [
    '0' => '예약취소',
    '1' => '예약요청',
    '2' => '예약확정',
    '3' => '예약불가',
    '4' => '재주문',
];

$_INC['confirm_type'] = [
    '0' => '예약취소',
    '1' => '확정대기',
    '2' => '예약확정',
    '3' => '예약확정',
    '4' => '예약확정',
];

$_INC['option'] = [
    '1' => '락카',
    '2' => '카트',
    '3' => '캐디',
    '4' => '클럽',
    '5' => '숙박',
    '6' => '송영',
];

$_INC['payment_type'] = [
    '1' => '결제미요청',
    '2' => '결제요청',
    '3' => '결제완료',
    '4' => '부분취소',
    '5' => '결제취소',
];

// 상품구분
$_INC['prod_kind'] = [
    '1'     => '티타임',
    '2'     => '항공+',
    '3'     => '숙박+',
    '4'     => '송영+',
    '5'     => '항공/숙박+',
    '6'     => '항공/송영+',
    '7'     => '숙박/송영+',
    '8'     => '항공/숙박/송영+',
    '9'     => '다색',
];

$_INC['social'] = [
    'GOOGLE' => '구글',
    'APPLE' => '애플',
    'FACEBOOK' => '페이스북',
    'LINE' => '라인',
    'KAKAO' => '카카오',
    'NAVER' => '네이버',
    'EMAIL' => '이메일',
];

// TODO: 임시 데이터 => 협의 필요
$_INC['cancel_type'] = [
  '1' => '사용자 요청',
  '2' => '이중 결제',
  '3' => '기타',
];
